54 new parameters

* optimization coverage
  opt.dat - coverage of 01/output/init.offxml by 02/ds/combined-opt.json

  #+begin_src shell
	python ffcover.py \
		   -f ../output/initial-force-field-openff-2.1.0.offxml \
		   -d ../../02_curate-data/datasets/combined-opt.json | tee opt.dat
  #+end_src

  #+RESULTS:
  | pid    |   env |  rec |  smi |
  | t1     |  7887 |  815 |  815 |
  | t2     |  1445 |  379 |  379 |
  | t3     |  9167 |  828 |  828 |
  | t4     |  9018 |  618 |  618 |
  | t5     |    63 |   42 |   42 |
  | t6     |     4 |    2 |    2 |
  | t7     |     2 |    2 |    2 |
  | t8     |     2 |    2 |    2 |
  | t9     |  1519 |  378 |  378 |
  | t10    |   173 |   41 |   41 |
  | t11    |    18 |    4 |    4 |
  | t12    |     6 |    3 |    3 |
  | t13    |   288 |   71 |   71 |
  | t14    |   558 |   71 |   71 |
  | t15    |  1972 |  155 |  155 |
  | t16    |  1956 |  153 |  153 |
  | t17    |  7460 |  995 |  995 |
  | t18    |  1210 |  508 |  508 |
  | t18a   |   142 |   44 |   44 |
  | t18b   |     0 |    0 |    0 |
  | t19    |   732 |  313 |  313 |
  | t19a   |   128 |   41 |   41 |
  | t20    |   706 |  217 |  217 |
  | t21    |    82 |   33 |   33 |
  | t22    |    74 |   71 |   71 |
  | t23    |   196 |  145 |  145 |
  | t24    |    77 |   33 |   33 |
  | t25    |    18 |   18 |   18 |
  | t26    |     7 |    7 |    7 |
  | t27    |   123 |   67 |   67 |
  | t28    |    15 |   14 |   14 |
  | t29    |    21 |   13 |   13 |
  | t30    |    14 |   14 |   14 |
  | t31    |    20 |   18 |   18 |
  | t31a   |    10 |    5 |    5 |
  | t32    |    25 |   15 |   15 |
  | t33    |     6 |    5 |    5 |
  | t34    |    10 |    5 |    5 |
  | t35    |   130 |   46 |   46 |
  | t36    |     6 |    3 |    3 |
  | t37    |     4 |    2 |    2 |
  | t38    |    12 |    6 |    6 |
  | t39    |    74 |   32 |   32 |
  | t40    |    12 |    6 |    6 |
  | t41    |    22 |   11 |   11 |
  | t42    |    64 |   30 |   30 |
  | t42a   |    20 |    5 |    5 |
  | t43    |  1467 |  317 |  317 |
  | t44    | 38836 | 1291 | 1291 |
  | t45    |  2731 |  516 |  516 |
  | t46    |    89 |   74 |   74 |
  | t47    |  2761 |  605 |  605 |
  | t48    |   171 |  148 |  148 |
  | t48a   |    12 |    6 |    6 |
  | t49    |    24 |    6 |    6 |
  | t50    |  2286 |  132 |  132 |
  | t51    |  2392 |  228 |  228 |
  | t52    |     6 |    3 |    3 |
  | t53    |    12 |    3 |    3 |
  | t54    |     2 |    1 |    1 |
  | t55    |     4 |    1 |    1 |
  | t56    |     2 |    1 |    1 |
  | t57    |    10 |    2 |    2 |
  | t58g   |   378 |   96 |   96 |
  | t58h   |   506 |  139 |  139 |
  | t59g   |    28 |   12 |   12 |
  | t59h   |    16 |   12 |   12 |
  | t60g   |    56 |   12 |   12 |
  | t60h   |    32 |   12 |   12 |
  | t61g   |     8 |    8 |    8 |
  | t61h   |     8 |    8 |    8 |
  | t62g   |    16 |    8 |    8 |
  | t62h   |    16 |    8 |    8 |
  | t63    |    18 |    3 |    3 |
  | t64    |  4741 |  583 |  583 |
  | t65    |     0 |    0 |    0 |
  | t66    |   202 |  155 |  155 |
  | t67    |   435 |  238 |  238 |
  | t68    |     7 |    7 |    7 |
  | t69    |    72 |   26 |   26 |
  | t70    |    20 |    9 |    9 |
  | t71g   |    50 |   26 |   26 |
  | t71h   |    38 |   23 |   23 |
  | t72g   |    26 |   26 |   26 |
  | t72h   |    31 |   23 |   23 |
  | t73g   |   612 |  126 |  126 |
  | t73h   |    17 |    9 |    9 |
  | t74g   |  1586 |  351 |  351 |
  | t74h   |    26 |   12 |   12 |
  | t75    |  1637 |  545 |  545 |
  | t76    |   135 |  127 |  127 |
  | t77    |   365 |  260 |  260 |
  | t78    |   299 |  228 |  228 |
  | t79    |   196 |   55 |   55 |
  | t80    |  2448 |  361 |  361 |
  | t81    |     0 |    0 |    0 |
  | t82g   |   202 |  193 |  193 |
  | t82h   |     6 |    6 |    6 |
  | t82a   |    22 |   11 |   11 |
  | t83g   |   317 |  251 |  251 |
  | t83h   |    28 |   17 |   17 |
  | t83a   |   166 |   46 |   46 |
  | t84g   |   835 |  284 |  284 |
  | t84h   |     0 |    0 |    0 |
  | t85    |   601 |  272 |  272 |
  | t86    |  1082 |  435 |  435 |
  | t87    |   196 |   49 |   49 |
  | t87a   |     0 |    0 |    0 |
  | t88    |    12 |   12 |   12 |
  | t89    |     4 |    4 |    4 |
  | t90    |   102 |   42 |   42 |
  | t91    |     2 |    2 |    2 |
  | t92    |     7 |    4 |    4 |
  | t93    |   199 |  101 |  101 |
  | t94    |   173 |   98 |   98 |
  | t95    |  1964 |  557 |  557 |
  | t96    |   215 |   81 |   81 |
  | t97    |   374 |  255 |  255 |
  | t98    |    22 |   10 |   10 |
  | t99    |     4 |    4 |    4 |
  | t100   |     4 |    2 |    2 |
  | t101   |     2 |    2 |    2 |
  | t102   |     9 |    9 |    9 |
  | t103   |     4 |    4 |    4 |
  | t104   |    26 |   13 |   13 |
  | t105   |   741 |  300 |  300 |
  | t106   |   233 |  111 |  111 |
  | t107   |   113 |  106 |  106 |
  | t108   |    75 |   74 |   74 |
  | t109   |    74 |   73 |   73 |
  | t110   |   100 |   94 |   94 |
  | t111   |   636 |  212 |  212 |
  | t112   |     0 |    0 |    0 |
  | t113g  |     2 |    1 |    1 |
  | t113h  |     0 |    0 |    0 |
  | t114   |    12 |    1 |    1 |
  | t115g  |   334 |  169 |  169 |
  | t115h  |   118 |   60 |   60 |
  | t115i  |     0 |    0 |    0 |
  | t116g  |    62 |   58 |   58 |
  | t116h  |   200 |   70 |   70 |
  | t116i  |     0 |    0 |    0 |
  | t116j  |     0 |    0 |    0 |
  | t117g  |   194 |  103 |  103 |
  | t117h  |     0 |    0 |    0 |
  | t117i  |     0 |    0 |    0 |
  | t117j  |     0 |    0 |    0 |
  | t117k  |     0 |    0 |    0 |
  | t117l  |     0 |    0 |    0 |
  | t118g  |  1121 |  104 |  104 |
  | t118h  |   161 |   26 |   26 |
  | t119g  |   147 |   28 |   28 |
  | t119h  |    33 |    8 |    8 |
  | t120g  |    46 |   23 |   23 |
  | t120h  |    10 |    8 |    8 |
  | t121g  |   780 |  126 |  126 |
  | t121h  |   102 |   35 |   35 |
  | t122g  |    10 |    5 |    5 |
  | t122h  |     8 |    4 |    4 |
  | t122i  |    64 |   16 |   16 |
  | t122j  |    20 |    5 |    5 |
  | t122k  |    64 |   32 |   32 |
  | t122l  |    30 |   15 |   15 |
  | t123ag |    18 |    2 |    2 |
  | t123ah |     0 |    0 |    0 |
  | t124g  |     0 |    0 |    0 |
  | t124h  |    24 |    2 |    2 |
  | t125   |     1 |    1 |    1 |
  | t126   |     1 |    1 |    1 |
  | t127g  |    24 |   24 |   24 |
  | t127h  |    14 |    7 |    7 |
  | t127i  |    15 |    5 |    5 |
  | t128   |    34 |   13 |   13 |
  | t129   |    24 |   20 |   20 |
  | t130g  |     0 |    0 |    0 |
  | t130h  |    14 |    5 |    5 |
  | t130i  |    21 |   10 |   10 |
  | t131g  |     0 |    0 |    0 |
  | t131h  |     0 |    0 |    0 |
  | t131i  |     7 |    2 |    2 |
  | t131j  |    17 |   10 |   10 |
  | t132g  |    10 |    4 |    4 |
  | t132h  |    11 |    5 |    5 |
  | t132i  |    18 |   12 |   12 |
  | t133g  |     0 |    0 |    0 |
  | t133h  |     0 |    0 |    0 |
  | t133i  |    24 |    9 |    9 |
  | t133j  |     8 |    8 |    8 |
  | t134g  |     6 |    1 |    1 |
  | t134h  |    40 |   10 |   10 |
  | t135   |     4 |    1 |    1 |
  | t136   |    12 |    3 |    3 |
  | t137   |    17 |   12 |   12 |
  | t138   |   338 |  156 |  156 |
  | t138a  |     0 |    0 |    0 |
  | t139   |    37 |   37 |   37 |
  | t140   |    68 |   68 |   68 |
  | t141   |     4 |    2 |    2 |
  | t141ag |    92 |   18 |   18 |
  | t141ah |     6 |    1 |    1 |
  | t141bg |     2 |    1 |    1 |
  | t141bh |     4 |    1 |    1 |
  | t141cg |   126 |   20 |   20 |
  | t141ch |     4 |    1 |    1 |
  | t141ci |     0 |    0 |    0 |
  | t141cj |     5 |    2 |    2 |
  | t142g  |    10 |    7 |    7 |
  | t142h  |    12 |    5 |    5 |
  | t142i  |    33 |   11 |   11 |
  | t142j  |     0 |    0 |    0 |
  | t142k  |     0 |    0 |    0 |
  | t143g  |    27 |   12 |   12 |
  | t143h  |    96 |   31 |   31 |
  | t143i  |     5 |    5 |    5 |
  | t143j  |    14 |    5 |    5 |
  | t143k  |    10 |    3 |    3 |
  | t144g  |     0 |    0 |    0 |
  | t144h  |    11 |   11 |   11 |
  | t144i  |     0 |    0 |    0 |
  | t144j  |     0 |    0 |    0 |
  | t145g  |     0 |    0 |    0 |
  | t145h  |    56 |   33 |   33 |
  | t145i  |     0 |    0 |    0 |
  | t145j  |     0 |    0 |    0 |
  | t146g  |     0 |    0 |    0 |
  | t146h  |    32 |   24 |   24 |
  | t146i  |     0 |    0 |    0 |
  | t146j  |     0 |    0 |    0 |
  | t147g  |     0 |    0 |    0 |
  | t147h  |    46 |   31 |   31 |
  | t147i  |     0 |    0 |    0 |
  | t147j  |     0 |    0 |    0 |
  | t148g  |     0 |    0 |    0 |
  | t148h  |   139 |   47 |   47 |
  | t148i  |     0 |    0 |    0 |
  | t148j  |     4 |    3 |    3 |
  | t149g  |     0 |    0 |    0 |
  | t149h  |   172 |   60 |   60 |
  | t149i  |     8 |    3 |    3 |
  | t149j  |     8 |    3 |    3 |
  | t150g  |    23 |   20 |   20 |
  | t150h  |     0 |    0 |    0 |
  | t151g  |    10 |   10 |   10 |
  | t151h  |     0 |    0 |    0 |
  | t152g  |    89 |   36 |   36 |
  | t152h  |     2 |    2 |    2 |
  | t153g  |     4 |    2 |    2 |
  | t153h  |     0 |    0 |    0 |
  | t154g  |    27 |    8 |    8 |
  | t154h  |     0 |    0 |    0 |
  | t155g  |     4 |    4 |    4 |
  | t155h  |     0 |    0 |    0 |
  | t156g  |    20 |   10 |   10 |
  | t156h  |     5 |    5 |    5 |
  | t157g  |    45 |   13 |   13 |
  | t157h  |    42 |   18 |   18 |
  | t158g  |     3 |    3 |    3 |
  | t158h  |     0 |    0 |    0 |
  | t158i  |     0 |    0 |    0 |
  | t158j  |     0 |    0 |    0 |
  | t159g  |     0 |    0 |    0 |
  | t159h  |    74 |   19 |   19 |
  | t160   |    22 |   11 |   11 |
  | t161g  |     8 |    4 |    4 |
  | t161h  |    37 |    7 |    7 |
  | t162g  |     1 |    1 |    1 |
  | t162h  |    13 |    7 |    7 |
  | t163g  |     3 |    3 |    3 |
  | t163h  |     4 |    4 |    4 |
  | t164   |     6 |    2 |    2 |
  | t165   |    24 |   24 |   24 |
  | t166   |   341 |  133 |  133 |
  | t167   |    18 |   12 |   12 |

  select uncovered parameters

  #+begin_src awk :in-file opt.dat :exports both
	NR == 1 { print "num", $0 }
	$NF == 0 { print ++row, $0 }
  #+end_src

  #+RESULTS:
  | num | pid    | env | rec | smi |
  |   1 | t18b   |   0 |   0 |   0 |
  |   2 | t65    |   0 |   0 |   0 |
  |   3 | t81    |   0 |   0 |   0 |
  |   4 | t84h   |   0 |   0 |   0 |
  |   5 | t87a   |   0 |   0 |   0 |
  |   6 | t112   |   0 |   0 |   0 |
  |   7 | t113h  |   0 |   0 |   0 |
  |   8 | t115i  |   0 |   0 |   0 |
  |   9 | t116i  |   0 |   0 |   0 |
  |  10 | t116j  |   0 |   0 |   0 |
  |  11 | t117h  |   0 |   0 |   0 |
  |  12 | t117i  |   0 |   0 |   0 |
  |  13 | t117j  |   0 |   0 |   0 |
  |  14 | t117k  |   0 |   0 |   0 |
  |  15 | t117l  |   0 |   0 |   0 |
  |  16 | t123ah |   0 |   0 |   0 |
  |  17 | t124g  |   0 |   0 |   0 |
  |  18 | t130g  |   0 |   0 |   0 |
  |  19 | t131g  |   0 |   0 |   0 |
  |  20 | t131h  |   0 |   0 |   0 |
  |  21 | t133g  |   0 |   0 |   0 |
  |  22 | t133h  |   0 |   0 |   0 |
  |  23 | t138a  |   0 |   0 |   0 |
  |  24 | t141ci |   0 |   0 |   0 |
  |  25 | t142j  |   0 |   0 |   0 |
  |  26 | t142k  |   0 |   0 |   0 |
  |  27 | t144g  |   0 |   0 |   0 |
  |  28 | t144i  |   0 |   0 |   0 |
  |  29 | t144j  |   0 |   0 |   0 |
  |  30 | t145g  |   0 |   0 |   0 |
  |  31 | t145i  |   0 |   0 |   0 |
  |  32 | t145j  |   0 |   0 |   0 |
  |  33 | t146g  |   0 |   0 |   0 |
  |  34 | t146i  |   0 |   0 |   0 |
  |  35 | t146j  |   0 |   0 |   0 |
  |  36 | t147g  |   0 |   0 |   0 |
  |  37 | t147i  |   0 |   0 |   0 |
  |  38 | t147j  |   0 |   0 |   0 |
  |  39 | t148g  |   0 |   0 |   0 |
  |  40 | t148i  |   0 |   0 |   0 |
  |  41 | t149g  |   0 |   0 |   0 |
  |  42 | t150h  |   0 |   0 |   0 |
  |  43 | t151h  |   0 |   0 |   0 |
  |  44 | t153h  |   0 |   0 |   0 |
  |  45 | t154h  |   0 |   0 |   0 |
  |  46 | t155h  |   0 |   0 |   0 |
  |  47 | t158h  |   0 |   0 |   0 |
  |  48 | t158i  |   0 |   0 |   0 |
  |  49 | t158j  |   0 |   0 |   0 |
  |  50 | t159g  |   0 |   0 |   0 |

* torsion drive coverage
  #+begin_src shell
	python ffcover.py \
		   -f ../output/initial-force-field-openff-2.1.0.offxml \
		   -d ../../02_curate-data/datasets/combined-td.json \
		   -t \
		| tee td.dat
  #+end_src

  #+RESULTS:
  | pid    |   env | rec | smi | tor |
  | t1     |  4653 | 625 | 494 |  16 |
  | t2     |   777 | 203 | 166 |  14 |
  | t3     |  5202 | 605 | 483 |  15 |
  | t4     |  5466 | 440 | 330 |  13 |
  | t5     |    35 |  29 |  27 |   8 |
  | t6     |    39 |  14 |  10 |  10 |
  | t7     |    18 |   8 |   5 |   5 |
  | t8     |     6 |   6 |   2 |   2 |
  | t9     |   921 | 201 | 171 |  12 |
  | t10    |   217 |  47 |  37 |   9 |
  | t11    |    68 |  15 |  11 |   6 |
  | t12    |    28 |  14 |   4 |   4 |
  | t13    |   329 |  83 |  52 |  10 |
  | t14    |   567 |  79 |  48 |   6 |
  | t15    |  2970 | 246 | 146 |   3 |
  | t16    |  2993 | 234 | 142 |   5 |
  | t17    |  3498 | 625 | 481 |  13 |
  | t18    |  1006 | 399 | 302 |  18 |
  | t18a   |    18 |   4 |   4 |   1 |
  | t18b   |    12 |   2 |   2 |   2 |
  | t19    |   630 | 263 | 193 |  14 |
  | t19a   |    18 |   4 |   4 |   1 |
  | t20    |   670 | 193 | 154 |  20 |
  | t21    |    88 |  40 |  32 |  12 |
  | t22    |    55 |  55 |  39 |   9 |
  | t23    |   158 | 126 |  80 |  13 |
  | t24    |   138 |  65 |  45 |   8 |
  | t25    |    27 |  27 |  17 |  10 |
  | t26    |    42 |  42 |  20 |  10 |
  | t27    |   222 | 127 |  62 |  13 |
  | t28    |    22 |  18 |  12 |   8 |
  | t29    |    45 |  29 |  17 |  12 |
  | t30    |     6 |   6 |   3 |   2 |
  | t31    |    30 |  30 |   8 |   4 |
  | t31a   |    26 |  13 |   1 |   2 |
  | t32    |    50 |  42 |   8 |   6 |
  | t33    |    21 |  19 |   4 |   4 |
  | t34    |    38 |  19 |  13 |   8 |
  | t35    |   152 |  53 |  30 |   7 |
  | t36    |    82 |  41 |   3 |   4 |
  | t37    |    28 |  14 |   6 |   5 |
  | t38    |    42 |  21 |  14 |   6 |
  | t39    |    72 |  33 |  16 |   8 |
  | t40    |    92 |  46 |  12 |   8 |
  | t41    |    74 |  36 |  14 |   7 |
  | t42    |    98 |  49 |  22 |   4 |
  | t42a   |    52 |  13 |   1 |   4 |
  | t43    |   760 | 157 | 124 |  18 |
  | t44    | 14368 | 531 | 419 |  20 |
  | t45    |  2134 | 419 | 291 |   5 |
  | t46    |    98 |  74 |  62 |   2 |
  | t47    |  1191 | 288 | 211 |  21 |
  | t48    |    91 |  87 |  77 |   9 |
  | t48a   |     2 |   1 |   1 |   1 |
  | t49    |    36 |   9 |   7 |   4 |
  | t50    |   801 |  39 |  33 |   4 |
  | t51    |  2745 | 265 | 227 |  12 |
  | t52    |    26 |   9 |   7 |   7 |
  | t53    |    22 |   9 |   7 |   3 |
  | t54    |    15 |  10 |   6 |   6 |
  | t55    |    51 |  12 |   8 |   3 |
  | t56    |    32 |   8 |   4 |   6 |
  | t57    |    22 |   5 |   4 |   3 |
  | t58g   |    54 |  18 |  16 |   3 |
  | t58h   |   369 | 111 |  97 |  10 |
  | t59g   |     0 |   0 |   0 |   0 |
  | t59h   |    55 |  37 |  16 |   4 |
  | t60g   |     0 |   0 |   0 |   0 |
  | t60h   |   110 |  37 |  16 |   6 |
  | t61g   |    24 |   2 |   2 |   0 |
  | t61h   |    23 |  20 |  13 |   3 |
  | t62g   |     8 |   2 |   2 |   2 |
  | t62h   |    46 |  20 |  13 |   1 |
  | t63    |    60 |  10 |  10 |   8 |
  | t64    |  2674 | 343 | 268 |  11 |
  | t65    |    36 |   6 |   6 |   6 |
  | t66    |   115 |  92 |  59 |  13 |
  | t67    |   289 | 140 | 108 |   6 |
  | t68    |    11 |   9 |   7 |   6 |
  | t69    |    70 |  28 |  22 |  14 |
  | t70    |    53 |  28 |  22 |   5 |
  | t71g   |    92 |  48 |  39 |   6 |
  | t71h   |    50 |  14 |  12 |   1 |
  | t72g   |    53 |  44 |  35 |   5 |
  | t72h   |     7 |   6 |   4 |   1 |
  | t73g   |   412 |  85 |  76 |   4 |
  | t73h   |    13 |  11 |   5 |   2 |
  | t74g   |   472 | 101 |  92 |   9 |
  | t74h   |    22 |  10 |   8 |   5 |
  | t75    |  1114 | 339 | 257 |  18 |
  | t76    |   116 |  95 |  56 |   2 |
  | t77    |   223 | 159 | 124 |   3 |
  | t78    |   151 | 126 |  92 |  15 |
  | t79    |   112 |  30 |  28 |   7 |
  | t80    |  1204 | 181 | 140 |  20 |
  | t81    |     4 |   2 |   2 |   1 |
  | t82g   |   175 | 162 |  96 |  10 |
  | t82h   |    11 |  11 |   5 |   1 |
  | t82a   |    22 |  11 |   9 |   3 |
  | t83g   |   188 | 161 | 105 |   8 |
  | t83h   |    17 |  14 |   8 |   1 |
  | t83a   |    90 |  28 |  22 |  12 |
  | t84g   |   506 | 150 | 110 |  13 |
  | t84h   |     0 |   0 |   0 |   0 |
  | t85    |   278 | 128 | 102 |  12 |
  | t86    |   805 | 371 | 252 |   3 |
  | t87    |   136 |  34 |  24 |   4 |
  | t87a   |    24 |   2 |   2 |   2 |
  | t88    |    10 |   9 |   9 |   2 |
  | t89    |     1 |   1 |   1 |   0 |
  | t90    |    72 |  47 |  29 |   6 |
  | t91    |    13 |  10 |   8 |   9 |
  | t92    |    23 |  16 |  13 |   2 |
  | t93    |   172 |  78 |  67 |   9 |
  | t94    |    91 |  48 |  42 |  10 |
  | t95    |  1382 | 347 | 266 |  15 |
  | t96    |   162 |  75 |  61 |  10 |
  | t97    |   140 |  84 |  71 |   9 |
  | t98    |    40 |  15 |   9 |   5 |
  | t99    |    14 |  14 |  12 |   6 |
  | t100   |    14 |   7 |   5 |   6 |
  | t101   |     4 |   4 |   2 |   1 |
  | t102   |     6 |   6 |   6 |   6 |
  | t103   |     8 |   8 |   5 |   4 |
  | t104   |    47 |  23 |  20 |   5 |
  | t105   |   314 | 134 | 100 |  17 |
  | t106   |   129 |  67 |  54 |  17 |
  | t107   |    80 |  75 |  60 |  13 |
  | t108   |    77 |  75 |  48 |   6 |
  | t109   |    60 |  59 |  32 |   6 |
  | t110   |    50 |  49 |  40 |   8 |
  | t111   |   344 | 129 |  73 |  18 |
  | t112   |     8 |   4 |   4 |   1 |
  | t113g  |    12 |   6 |   3 |   3 |
  | t113h  |     6 |   2 |   2 |   2 |
  | t114   |   180 |  16 |  13 |   4 |
  | t115g  |   300 | 162 | 113 |   6 |
  | t115h  |    58 |  41 |  35 |   8 |
  | t115i  |     0 |   0 |   0 |   0 |
  | t116g  |    79 |  74 |  43 |   1 |
  | t116h  |   209 |  63 |  52 |   7 |
  | t116i  |     0 |   0 |   0 |   0 |
  | t116j  |     0 |   0 |   0 |   0 |
  | t117g  |   207 | 108 |  68 |  15 |
  | t117h  |     0 |   0 |   0 |   0 |
  | t117i  |     0 |   0 |   0 |   0 |
  | t117j  |     0 |   0 |   0 |   0 |
  | t117k  |     0 |   0 |   0 |   0 |
  | t117l  |     0 |   0 |   0 |   0 |
  | t118g  |  1487 | 142 | 104 |  11 |
  | t118h  |    61 |  10 |  10 |   1 |
  | t119g  |   204 |  45 |  34 |  11 |
  | t119h  |    25 |   5 |   5 |   2 |
  | t120g  |    55 |  31 |  23 |   6 |
  | t120h  |     4 |   3 |   3 |   0 |
  | t121g  |   432 |  76 |  56 |  11 |
  | t121h  |    96 |  27 |  20 |   2 |
  | t122g  |    10 |   5 |   5 |   5 |
  | t122h  |     8 |   4 |   4 |   4 |
  | t122i  |    20 |   5 |   4 |   3 |
  | t122j  |    28 |   7 |   7 |   7 |
  | t122k  |    42 |  21 |  16 |   5 |
  | t122l  |     4 |   2 |   2 |   1 |
  | t123ag |   126 |  10 |  10 |   5 |
  | t123ah |     0 |   0 |   0 |   0 |
  | t124g  |     0 |   0 |   0 |   0 |
  | t124h  |    54 |   7 |   7 |   7 |
  | t125   |     9 |   9 |   8 |   7 |
  | t126   |     3 |   3 |   3 |   1 |
  | t127g  |    26 |  26 |  21 |   5 |
  | t127h  |    70 |  32 |  27 |   5 |
  | t127i  |    15 |   5 |   4 |   0 |
  | t128   |    16 |   8 |   7 |   4 |
  | t129   |    48 |  47 |  14 |   8 |
  | t130g  |     0 |   0 |   0 |   0 |
  | t130h  |     2 |   1 |   1 |   0 |
  | t130i  |    41 |  15 |  15 |   8 |
  | t131g  |     0 |   0 |   0 |   0 |
  | t131h  |     0 |   0 |   0 |   0 |
  | t131i  |    23 |   6 |   2 |   1 |
  | t131j  |    44 |  25 |  19 |   6 |
  | t132g  |    27 |  10 |   6 |   1 |
  | t132h  |     3 |   1 |   1 |   0 |
  | t132i  |    44 |  25 |  19 |   7 |
  | t133g  |     9 |   1 |   1 |   1 |
  | t133h  |     0 |   0 |   0 |   0 |
  | t133i  |    23 |   6 |   6 |   6 |
  | t133j  |    13 |  10 |  10 |   3 |
  | t134g  |     6 |   1 |   1 |   1 |
  | t134h  |    38 |  10 |   9 |   4 |
  | t135   |    32 |   8 |   5 |   7 |
  | t136   |    56 |  14 |   7 |  10 |
  | t137   |    19 |  15 |   6 |   7 |
  | t138   |   248 | 109 |  82 |   8 |
  | t138a  |     0 |   0 |   0 |   0 |
  | t139   |    21 |  21 |  12 |   6 |
  | t140   |    93 |  93 |  45 |  13 |
  | t141   |    16 |   7 |   7 |   0 |
  | t141ag |    56 |  12 |  11 |   1 |
  | t141ah |     0 |   0 |   0 |   0 |
  | t141bg |     2 |   1 |   1 |   0 |
  | t141bh |     8 |   2 |   2 |   2 |
  | t141cg |    53 |   8 |   8 |   0 |
  | t141ch |     0 |   0 |   0 |   0 |
  | t141ci |     0 |   0 |   0 |   0 |
  | t141cj |    12 |   4 |   4 |   0 |
  | t142g  |    25 |  18 |   7 |   3 |
  | t142h  |    20 |   9 |   9 |   9 |
  | t142i  |    48 |  16 |  11 |   9 |
  | t142j  |     0 |   0 |   0 |   0 |
  | t142k  |     0 |   0 |   0 |   0 |
  | t143g  |    38 |  18 |  14 |   2 |
  | t143h  |   147 |  52 |  35 |   5 |
  | t143i  |     6 |   6 |   6 |   6 |
  | t143j  |    14 |   5 |   5 |   5 |
  | t143k  |     6 |   2 |   2 |   2 |
  | t144g  |     0 |   0 |   0 |   0 |
  | t144h  |    38 |  35 |  25 |   5 |
  | t144i  |     0 |   0 |   0 |   0 |
  | t144j  |     0 |   0 |   0 |   0 |
  | t145g  |     0 |   0 |   0 |   0 |
  | t145h  |    23 |  20 |  15 |   4 |
  | t145i  |     0 |   0 |   0 |   0 |
  | t145j  |     0 |   0 |   0 |   0 |
  | t146g  |     0 |   0 |   0 |   0 |
  | t146h  |    37 |  28 |  21 |   8 |
  | t146i  |     0 |   0 |   0 |   0 |
  | t146j  |     0 |   0 |   0 |   0 |
  | t147g  |     0 |   0 |   0 |   0 |
  | t147h  |    34 |  22 |  14 |  11 |
  | t147i  |     0 |   0 |   0 |   0 |
  | t147j  |     0 |   0 |   0 |   0 |
  | t148g  |     0 |   0 |   0 |   0 |
  | t148h  |   140 |  64 |  49 |   4 |
  | t148i  |     0 |   0 |   0 |   0 |
  | t148j  |     4 |   3 |   3 |   0 |
  | t149g  |     0 |   0 |   0 |   0 |
  | t149h  |   155 |  53 |  38 |   2 |
  | t149i  |     6 |   2 |   2 |   0 |
  | t149j  |     8 |   3 |   3 |   0 |
  | t150g  |    10 |   9 |   7 |   5 |
  | t150h  |     0 |   0 |   0 |   0 |
  | t151g  |    19 |  19 |  10 |   9 |
  | t151h  |     0 |   0 |   0 |   0 |
  | t152g  |    74 |  32 |  21 |   4 |
  | t152h  |     2 |   2 |   2 |   0 |
  | t153g  |    25 |  13 |   7 |   7 |
  | t153h  |     0 |   0 |   0 |   0 |
  | t154g  |    72 |  21 |  12 |   7 |
  | t154h  |     4 |   2 |   2 |   0 |
  | t155g  |     8 |   8 |   6 |   4 |
  | t155h  |     1 |   1 |   1 |   1 |
  | t156g  |    32 |  15 |  13 |   4 |
  | t156h  |     7 |   7 |   7 |   0 |
  | t157g  |    75 |  20 |  19 |  15 |
  | t157h  |    72 |  29 |  22 |  10 |
  | t158g  |     5 |   5 |   5 |   4 |
  | t158h  |     0 |   0 |   0 |   0 |
  | t158i  |     0 |   0 |   0 |   0 |
  | t158j  |     0 |   0 |   0 |   0 |
  | t159g  |     0 |   0 |   0 |   0 |
  | t159h  |   162 |  44 |  31 |   4 |
  | t160   |    84 |  34 |  25 |   7 |
  | t161g  |    10 |   5 |   3 |   0 |
  | t161h  |   129 |  24 |  11 |   6 |
  | t162g  |     3 |   3 |   1 |   1 |
  | t162h  |    49 |  24 |  11 |   1 |
  | t163g  |     2 |   2 |   2 |   2 |
  | t163h  |    14 |  14 |   7 |   6 |
  | t164   |    15 |   5 |   2 |   1 |
  | t165   |    17 |  17 |  13 |   0 |
  | t166   |   210 |  79 |  63 |   0 |
  | t167   |    41 |  28 |  26 |   0 |

  select uncovered parameters

  #+begin_src awk :in-file td.dat :exports both
	NR == 1 { print "num", $0 }
	$NF == 0 { print ++row, $0 }
  #+end_src

  #+RESULTS:
  | num | pid    | env | rec | smi | tor |
  |   1 | t59g   |   0 |   0 |   0 |   0 |
  |   2 | t60g   |   0 |   0 |   0 |   0 |
  |   3 | t61g   |  24 |   2 |   2 |   0 |
  |   4 | t84h   |   0 |   0 |   0 |   0 |
  |   5 | t89    |   1 |   1 |   1 |   0 |
  |   6 | t115i  |   0 |   0 |   0 |   0 |
  |   7 | t116i  |   0 |   0 |   0 |   0 |
  |   8 | t116j  |   0 |   0 |   0 |   0 |
  |   9 | t117h  |   0 |   0 |   0 |   0 |
  |  10 | t117i  |   0 |   0 |   0 |   0 |
  |  11 | t117j  |   0 |   0 |   0 |   0 |
  |  12 | t117k  |   0 |   0 |   0 |   0 |
  |  13 | t117l  |   0 |   0 |   0 |   0 |
  |  14 | t120h  |   4 |   3 |   3 |   0 |
  |  15 | t123ah |   0 |   0 |   0 |   0 |
  |  16 | t124g  |   0 |   0 |   0 |   0 |
  |  17 | t127i  |  15 |   5 |   4 |   0 |
  |  18 | t130g  |   0 |   0 |   0 |   0 |
  |  19 | t130h  |   2 |   1 |   1 |   0 |
  |  20 | t131g  |   0 |   0 |   0 |   0 |
  |  21 | t131h  |   0 |   0 |   0 |   0 |
  |  22 | t132h  |   3 |   1 |   1 |   0 |
  |  23 | t133h  |   0 |   0 |   0 |   0 |
  |  24 | t138a  |   0 |   0 |   0 |   0 |
  |  25 | t141   |  16 |   7 |   7 |   0 |
  |  26 | t141ah |   0 |   0 |   0 |   0 |
  |  27 | t141bg |   2 |   1 |   1 |   0 |
  |  28 | t141cg |  53 |   8 |   8 |   0 |
  |  29 | t141ch |   0 |   0 |   0 |   0 |
  |  30 | t141ci |   0 |   0 |   0 |   0 |
  |  31 | t141cj |  12 |   4 |   4 |   0 |
  |  32 | t142j  |   0 |   0 |   0 |   0 |
  |  33 | t142k  |   0 |   0 |   0 |   0 |
  |  34 | t144g  |   0 |   0 |   0 |   0 |
  |  35 | t144i  |   0 |   0 |   0 |   0 |
  |  36 | t144j  |   0 |   0 |   0 |   0 |
  |  37 | t145g  |   0 |   0 |   0 |   0 |
  |  38 | t145i  |   0 |   0 |   0 |   0 |
  |  39 | t145j  |   0 |   0 |   0 |   0 |
  |  40 | t146g  |   0 |   0 |   0 |   0 |
  |  41 | t146i  |   0 |   0 |   0 |   0 |
  |  42 | t146j  |   0 |   0 |   0 |   0 |
  |  43 | t147g  |   0 |   0 |   0 |   0 |
  |  44 | t147i  |   0 |   0 |   0 |   0 |
  |  45 | t147j  |   0 |   0 |   0 |   0 |
  |  46 | t148g  |   0 |   0 |   0 |   0 |
  |  47 | t148i  |   0 |   0 |   0 |   0 |
  |  48 | t148j  |   4 |   3 |   3 |   0 |
  |  49 | t149g  |   0 |   0 |   0 |   0 |
  |  50 | t149i  |   6 |   2 |   2 |   0 |
  |  51 | t149j  |   8 |   3 |   3 |   0 |
  |  52 | t150h  |   0 |   0 |   0 |   0 |
  |  53 | t151h  |   0 |   0 |   0 |   0 |
  |  54 | t152h  |   2 |   2 |   2 |   0 |
  |  55 | t153h  |   0 |   0 |   0 |   0 |
  |  56 | t154h  |   4 |   2 |   2 |   0 |
  |  57 | t156h  |   7 |   7 |   7 |   0 |
  |  58 | t158h  |   0 |   0 |   0 |   0 |
  |  59 | t158i  |   0 |   0 |   0 |   0 |
  |  60 | t158j  |   0 |   0 |   0 |   0 |
  |  61 | t159g  |   0 |   0 |   0 |   0 |
  |  62 | t161g  |  10 |   5 |   3 |   0 |
  |  63 | t165   |  17 |  17 |  13 |   0 |
  |  64 | t166   | 210 |  79 |  63 |   0 |
  |  65 | t167   |  41 |  28 |  26 |   0 |

* benchmark coverage
  #+begin_src shell
	python 01_generate-forcefield/multiplicity/ffcover.py \
		   -f 01_generate-forcefield/output/initial-force-field-openff-2.1.0.offxml \
		   -d ../benchmarking/datasets/industry.json \
		| tee 01_generate-forcefield/multiplicity/bench.dat
  #+end_src

  #+begin_src awk :in-file bench.dat :exports both
	NR == 1 { print "num", $0 }
	$NF == 0 { print ++row, $0 }
  #+end_src

  #+RESULTS:

* Sage 2.2.0 coverage
  #+begin_src shell
	python ffcover.py \
		   -f ../../../benchmarking/forcefields/sage-2.2.0.offxml \
		   -d ../../02_curate-data/datasets/combined-td.json \
		   -t \
		| tee output/sage-2.2/td.dat
  #+end_src

  #+begin_src awk :in-file output/sage-2.2/td.dat :exports both
	NR == 1 { print "num", $0 }
	$NF == 0 { print ++row, $0 }
  #+end_src

  #+RESULTS:
  | num | pid   | env | rec | smi | tor |
  |   1 | t89   |   1 |   1 |   1 |   0 |
  |   2 | t138a |   0 |   0 |   0 |   0 |
  |   3 | t141  |  16 |   7 |   7 |   0 |
  |   4 | t141c |  65 |  12 |  12 |   0 |
  |   5 | t165  |  17 |  17 |  13 |   0 |
  |   6 | t166  | 210 |  79 |  63 |   0 |
  |   7 | t167  |  41 |  28 |  26 |   0 |
